app/Controllers/Crud/AuthorController.php

SELECT *
FROM `author`
WHERE `author`.`deleted_at` IS NULL
---
    public function index()
    {

        $author = $this->author->findAll();

SELECT *
FROM `author`
WHERE `author`.`deleted_at` IS NULL
AND `author`.`id` = '11'
UPDATE `author` SET `is_admin` = 0, `updated_at` = '2023-10-19 10:03:01'
WHERE `author`.`id` IN ('11')
---
    public function update($id)
    {


        $status_admin = $this->author->find($id);

        $this->author->update($id, [
            'is_admin' => !$status_admin['is_admin']
        ]);