app/Controllers/Crud/AuthController.php

SELECT *
FROM `author`
WHERE `email` = 'raka@gmail.com'
AND `author`.`deleted_at` IS NULL
 LIMIT 1
---
    public function signin()
    {

        $validation = \Config\Services::validation();
        $rules = [
            'email' => [
                'label'    => 'Email',
                'rules'    => 'required',
                'errors'    => [
                    'required'    => '{field} is required.'
                ]
            ],
            'password' => [
                'label'    => 'Password',
                'rules'    => 'required',
                'errors'    => [
                    'required'    => '{field} is required.'
                ]
            ],
        ];
        if (!$this->validate($rules)) {
            return redirect()->back()->with('validation', $validation->getErrors());
        }

        // get data
        $data = $this->request->getVar();
        $user = $this->author->where('email', $data['email'])->first();