app/Controllers/Crud/CategoryController.php

SELECT *
FROM `category`
WHERE `category`.`deleted_at` IS NULL
---
    public function index()
    {
        $category = $this->category->findAll();