app/Controllers/Crud/PostController.php

SELECT *
FROM `author`
WHERE `email` = 'reza@gmail.com'
AND `is_admin` = 1
AND `author`.`deleted_at` IS NULL
 LIMIT 1
SELECT *
FROM `post`
WHERE `post`.`deleted_at` IS NULL
SELECT *
FROM `post`
WHERE `is_public` = 1
AND `post`.`deleted_at` IS NULL
---
    public function index()
    {
        $title = 'Posts';
        // $posts = $this->post->where('is_public', true)->findAll();
        $posts = [];


        // ambil data user
        $user = session()->get('verified');

        // cek admin apa bukan
        $is_admin = $this->author->where('email', $user['email'] ?? null)->where('is_admin', true)->first();




        // cek post yg akan ditampilkan
        if ($is_admin) {
            $posts = $this->post->findAll();
            $is_admin = true;
        } else {
            $posts = $this->post->where('is_public', true)->findAll();

SELECT *
FROM `post`
WHERE `name` = 'user biasa udapte'
AND `post`.`deleted_at` IS NULL
 LIMIT 1
SELECT *
FROM `category`
WHERE `category`.`deleted_at` IS NULL
---
    public function edit($name)
    {
        $title = 'Create Post';


        $post = $this->post->where('name', $name)->first();
        // var_dump($post);

        $category = $this->category->findAll();