app/Controllers/Crud/PostController.php

    public function index()
    {
        $title = 'Posts';
        $posts = $this->post->where('is_public', true)->findAll();
---
SELECT *
FROM `post`
WHERE `is_public` = 1
AND `post`.`deleted_at` IS NULL

    public function edit($name)
    {
        $title = 'Create Post';


        $post = $this->post->where('name', $name)->first();
        // var_dump($post);

        $category = $this->category->findAll();
        $author = $this->author->findAll();
---
SELECT *
FROM `post`
WHERE `name` = 'Olahraga teratur'
AND `post`.`deleted_at` IS NULL
 LIMIT 1
SELECT *
FROM `category`
WHERE `category`.`deleted_at` IS NULL
SELECT *
FROM `author`
WHERE `author`.`deleted_at` IS NULL