app/Controllers/Crud/PostController.php

    public function index()
    {
        $title = 'Posts';
        $posts = $this->post->findAll();
---
SELECT *
FROM `post`
WHERE `post`.`deleted_at` IS NULL